Documents/ЗаявкаНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>ЗаявкаНаТранспорт</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ПродажаТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеБригады</xr:Item>
				<xr:Item>AccumulationRegister.КилометражВодителя</xr:Item>
				<xr:Item>AccumulationRegister.СостояниеБригад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПродажаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Бригады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>Бригады</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/СостояниеБригад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>СостояниеБригад</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаявкаНаТранспорт/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция Сверка()
	Объект.НомерАвтомобиля=Объект.Автомобиль.НомерАвтомобиля;
	флаг=ложь;
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бригады.НомерАвтомобиля КАК НомерАвтомобиля,
		|	Бригады.Водитель КАК Водитель,
		|	Бригады.Грузчик1 КАК Грузчик1,
		|	Бригады.Грузчик2 КАК Грузчик2
		|ИЗ
		|	РегистрСведений.Бригады КАК Бригады";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		если  Выборка.НомерАвтомобиля=Объект.Автомобиль.НомерАвтомобиля Тогда
			флаг=истина;
		КонецЕсли;
	КонецЦикла; 	
	если флаг=Истина тогда
		
			
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеБригадОстатки.КилометражОстаток КАК КилометражОстаток
		|ИЗ
		|	РегистрНакопления.СостояниеБригад.Остатки(, НомерАвтомобиля = &НомерАвтомобиля) КАК СостояниеБригадОстатки";
	
	Запрос.УстановитьПараметр("НомерАвтомобиля",Объект.НомерАвтомобиля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Километраж=Выборка.КилометражОстаток;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
возврат истина;
	иначе возврат ложь;
	конецЕсли;
КонецФункции

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)

	если Сверка()=ложь тогда
		Объект.Автомобиль=NULL;
		Объект.Километраж=NULL;
	КонецЕсли;

	

КонецПроцедуры

&НаКлиенте
Процедура НомерАвтоПриИзменении(Элемент)
	ном=Элемент;

КонецПроцедуры

&НаСервере
Функция Коректор()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеБригадОстатки.КилометражОстаток КАК КилометражОстаток
		|ИЗ
		|	РегистрНакопления.СостояниеБригад.Остатки(, НомерАвтомобиля = &НомерАвтомобиля) КАК СостояниеБригадОстатки";
	
	Запрос.УстановитьПараметр("НомерАвтомобиля",Объект.НомерАвтомобиля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		теккил=Выборка.КилометражОстаток;
	КонецЦикла;

	Объект.Километраж=теккил+Объект.ТекущееСостояниеЗаказа.Километраж;
КонецФункции

&НаКлиенте
Процедура ТекущееСостояниеЗаказаПриИзменении(Элемент)
	Коректор();
КонецПроцедуры

&НаСервере
Функция ПолучениеАдреса()
		стр=объект.Покупатель.Адресс;
		возврат стр;
	КонецФункции
	
	&НаСервере
Функция ПолучениеКонтактногоЛица()
		стр=объект.Покупатель.КонтактноеЛицо;
		возврат стр;
КонецФункции

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	Объект.КонтактноеЛицо = ПолучениеКонтактногоЛица();
	Объект.Адресс= ПолучениеАдреса();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.КонтактноеЛицо = ПолучениеКонтактногоЛица();
	Объект.Адресс= ПолучениеАдреса();

КонецПроцедуры
